# Temperature Rating Methods

Source: https://www.revitapidocs.com/2026/af81ef60-9b8c-4223-fd44-df03f043cafa.htm

---

| Temperature Rating Methods |
| --- |

The TemperatureRating type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a Conductor Temperature Rating. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetTemperatureRating | Gets the Conductor Temperature Rating data by given Conductor Temperature Rating id. |
|  | GetTemperatureRatingIdByName | Gets the Conductor Temperature Rating id by given Conductor Temperature Rating name. |
|  | GetTemperatureRatingIds | Gets all the Conductor Temperature Rating ids in the given document, sorted by name. |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

TemperatureRating Class Autodesk.Revit.DB.Electrical Namespace